backend: tensorflow
class_name: Model
config:
  input_layers:
  - [input_1, 0, 0]
  layers:
  - class_name: InputLayer
    config:
      batch_input_shape: !!python/tuple [null, 200, 200, 3]
      dtype: float32
      name: input_1
      sparse: false
    inbound_nodes: []
    name: input_1
  - class_name: ZeroPadding2D
    config:
      data_format: channels_last
      name: conv1_pad
      padding: !!python/tuple
      - !!python/tuple [3, 3]
      - !!python/tuple [3, 3]
      trainable: false
    inbound_nodes:
    - - - input_1
        - 0
        - 0
        - {}
    name: conv1_pad
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: &id001 !!python/tuple [1, 1]
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [7, 7]
      name: conv1
      padding: valid
      strides: !!python/tuple [2, 2]
      trainable: false
      use_bias: true
    inbound_nodes:
    - - - conv1_pad
        - 0
        - 0
        - {}
    name: conv1
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: bn_conv1
      scale: true
      trainable: false
    inbound_nodes:
    - - - conv1
        - 0
        - 0
        - {}
    name: bn_conv1
  - class_name: Activation
    config: {activation: relu, name: activation_1, trainable: false}
    inbound_nodes:
    - - - bn_conv1
        - 0
        - 0
        - {}
    name: activation_1
  - class_name: MaxPooling2D
    config:
      data_format: channels_last
      name: max_pooling2d_1
      padding: valid
      pool_size: !!python/tuple [3, 3]
      strides: !!python/tuple [2, 2]
      trainable: false
    inbound_nodes:
    - - - activation_1
        - 0
        - 0
        - {}
    name: max_pooling2d_1
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: &id009 !!python/tuple [1, 1]
      name: res2a_branch2a
      padding: valid
      strides: &id003 !!python/tuple [1, 1]
      trainable: false
      use_bias: true
    inbound_nodes:
    - - - max_pooling2d_1
        - 0
        - 0
        - {}
    name: res2a_branch2a
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: bn2a_branch2a
      scale: true
      trainable: false
    inbound_nodes:
    - - - res2a_branch2a
        - 0
        - 0
        - {}
    name: bn2a_branch2a
  - class_name: Activation
    config: {activation: relu, name: activation_2, trainable: false}
    inbound_nodes:
    - - - bn2a_branch2a
        - 0
        - 0
        - {}
    name: activation_2
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [3, 3]
      name: res2a_branch2b
      padding: same
      strides: &id002 !!python/tuple [1, 1]
      trainable: false
      use_bias: true
    inbound_nodes:
    - - - activation_2
        - 0
        - 0
        - {}
    name: res2a_branch2b
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: bn2a_branch2b
      scale: true
      trainable: false
    inbound_nodes:
    - - - res2a_branch2b
        - 0
        - 0
        - {}
    name: bn2a_branch2b
  - class_name: Activation
    config: {activation: relu, name: activation_3, trainable: false}
    inbound_nodes:
    - - - bn2a_branch2b
        - 0
        - 0
        - {}
    name: activation_3
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 256
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: &id010 !!python/tuple [1, 1]
      name: res2a_branch2c
      padding: valid
      strides: *id002
      trainable: false
      use_bias: true
    inbound_nodes:
    - - - activation_3
        - 0
        - 0
        - {}
    name: res2a_branch2c
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 256
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: &id011 !!python/tuple [1, 1]
      name: res2a_branch1
      padding: valid
      strides: *id003
      trainable: false
      use_bias: true
    inbound_nodes:
    - - - max_pooling2d_1
        - 0
        - 0
        - {}
    name: res2a_branch1
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: bn2a_branch2c
      scale: true
      trainable: false
    inbound_nodes:
    - - - res2a_branch2c
        - 0
        - 0
        - {}
    name: bn2a_branch2c
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: bn2a_branch1
      scale: true
      trainable: false
    inbound_nodes:
    - - - res2a_branch1
        - 0
        - 0
        - {}
    name: bn2a_branch1
  - class_name: Add
    config: {name: add_1, trainable: false}
    inbound_nodes:
    - - - bn2a_branch2c
        - 0
        - 0
        - &id004 {}
      - - bn2a_branch1
        - 0
        - 0
        - *id004
    name: add_1
  - class_name: Activation
    config: {activation: relu, name: activation_4, trainable: false}
    inbound_nodes:
    - - - add_1
        - 0
        - 0
        - {}
    name: activation_4
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: &id006 !!python/tuple [1, 1]
      name: res2b_branch2a
      padding: valid
      strides: *id002
      trainable: false
      use_bias: true
    inbound_nodes:
    - - - activation_4
        - 0
        - 0
        - {}
    name: res2b_branch2a
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: bn2b_branch2a
      scale: true
      trainable: false
    inbound_nodes:
    - - - res2b_branch2a
        - 0
        - 0
        - {}
    name: bn2b_branch2a
  - class_name: Activation
    config: {activation: relu, name: activation_5, trainable: false}
    inbound_nodes:
    - - - bn2b_branch2a
        - 0
        - 0
        - {}
    name: activation_5
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [3, 3]
      name: res2b_branch2b
      padding: same
      strides: *id002
      trainable: false
      use_bias: true
    inbound_nodes:
    - - - activation_5
        - 0
        - 0
        - {}
    name: res2b_branch2b
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: bn2b_branch2b
      scale: true
      trainable: false
    inbound_nodes:
    - - - res2b_branch2b
        - 0
        - 0
        - {}
    name: bn2b_branch2b
  - class_name: Activation
    config: {activation: relu, name: activation_6, trainable: false}
    inbound_nodes:
    - - - bn2b_branch2b
        - 0
        - 0
        - {}
    name: activation_6
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 256
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: &id007 !!python/tuple [1, 1]
      name: res2b_branch2c
      padding: valid
      strides: *id002
      trainable: false
      use_bias: true
    inbound_nodes:
    - - - activation_6
        - 0
        - 0
        - {}
    name: res2b_branch2c
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: bn2b_branch2c
      scale: true
      trainable: false
    inbound_nodes:
    - - - res2b_branch2c
        - 0
        - 0
        - {}
    name: bn2b_branch2c
  - class_name: Add
    config: {name: add_2, trainable: false}
    inbound_nodes:
    - - - bn2b_branch2c
        - 0
        - 0
        - &id005 {}
      - - activation_4
        - 0
        - 0
        - *id005
    name: add_2
  - class_name: Activation
    config: {activation: relu, name: activation_7, trainable: false}
    inbound_nodes:
    - - - add_2
        - 0
        - 0
        - {}
    name: activation_7
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: *id006
      name: res2c_branch2a
      padding: valid
      strides: *id002
      trainable: false
      use_bias: true
    inbound_nodes:
    - - - activation_7
        - 0
        - 0
        - {}
    name: res2c_branch2a
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: bn2c_branch2a
      scale: true
      trainable: false
    inbound_nodes:
    - - - res2c_branch2a
        - 0
        - 0
        - {}
    name: bn2c_branch2a
  - class_name: Activation
    config: {activation: relu, name: activation_8, trainable: false}
    inbound_nodes:
    - - - bn2c_branch2a
        - 0
        - 0
        - {}
    name: activation_8
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [3, 3]
      name: res2c_branch2b
      padding: same
      strides: *id002
      trainable: false
      use_bias: true
    inbound_nodes:
    - - - activation_8
        - 0
        - 0
        - {}
    name: res2c_branch2b
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: bn2c_branch2b
      scale: true
      trainable: false
    inbound_nodes:
    - - - res2c_branch2b
        - 0
        - 0
        - {}
    name: bn2c_branch2b
  - class_name: Activation
    config: {activation: relu, name: activation_9, trainable: false}
    inbound_nodes:
    - - - bn2c_branch2b
        - 0
        - 0
        - {}
    name: activation_9
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 256
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: *id007
      name: res2c_branch2c
      padding: valid
      strides: *id002
      trainable: false
      use_bias: true
    inbound_nodes:
    - - - activation_9
        - 0
        - 0
        - {}
    name: res2c_branch2c
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: bn2c_branch2c
      scale: true
      trainable: false
    inbound_nodes:
    - - - res2c_branch2c
        - 0
        - 0
        - {}
    name: bn2c_branch2c
  - class_name: Add
    config: {name: add_3, trainable: false}
    inbound_nodes:
    - - - bn2c_branch2c
        - 0
        - 0
        - &id008 {}
      - - activation_7
        - 0
        - 0
        - *id008
    name: add_3
  - class_name: Activation
    config: {activation: relu, name: activation_10, trainable: false}
    inbound_nodes:
    - - - add_3
        - 0
        - 0
        - {}
    name: activation_10
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 128
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: *id009
      name: res3a_branch2a
      padding: valid
      strides: &id012 !!python/tuple [2, 2]
      trainable: false
      use_bias: true
    inbound_nodes:
    - - - activation_10
        - 0
        - 0
        - {}
    name: res3a_branch2a
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: bn3a_branch2a
      scale: true
      trainable: false
    inbound_nodes:
    - - - res3a_branch2a
        - 0
        - 0
        - {}
    name: bn3a_branch2a
  - class_name: Activation
    config: {activation: relu, name: activation_11, trainable: false}
    inbound_nodes:
    - - - bn3a_branch2a
        - 0
        - 0
        - {}
    name: activation_11
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 128
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [3, 3]
      name: res3a_branch2b
      padding: same
      strides: *id002
      trainable: false
      use_bias: true
    inbound_nodes:
    - - - activation_11
        - 0
        - 0
        - {}
    name: res3a_branch2b
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: bn3a_branch2b
      scale: true
      trainable: false
    inbound_nodes:
    - - - res3a_branch2b
        - 0
        - 0
        - {}
    name: bn3a_branch2b
  - class_name: Activation
    config: {activation: relu, name: activation_12, trainable: false}
    inbound_nodes:
    - - - bn3a_branch2b
        - 0
        - 0
        - {}
    name: activation_12
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 512
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: *id010
      name: res3a_branch2c
      padding: valid
      strides: *id002
      trainable: false
      use_bias: true
    inbound_nodes:
    - - - activation_12
        - 0
        - 0
        - {}
    name: res3a_branch2c
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 512
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: *id011
      name: res3a_branch1
      padding: valid
      strides: *id012
      trainable: false
      use_bias: true
    inbound_nodes:
    - - - activation_10
        - 0
        - 0
        - {}
    name: res3a_branch1
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: bn3a_branch2c
      scale: true
      trainable: false
    inbound_nodes:
    - - - res3a_branch2c
        - 0
        - 0
        - {}
    name: bn3a_branch2c
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: bn3a_branch1
      scale: true
      trainable: false
    inbound_nodes:
    - - - res3a_branch1
        - 0
        - 0
        - {}
    name: bn3a_branch1
  - class_name: Add
    config: {name: add_4, trainable: false}
    inbound_nodes:
    - - - bn3a_branch2c
        - 0
        - 0
        - &id013 {}
      - - bn3a_branch1
        - 0
        - 0
        - *id013
    name: add_4
  - class_name: Activation
    config: {activation: relu, name: activation_13, trainable: false}
    inbound_nodes:
    - - - add_4
        - 0
        - 0
        - {}
    name: activation_13
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 128
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: *id006
      name: res3b_branch2a
      padding: valid
      strides: *id002
      trainable: false
      use_bias: true
    inbound_nodes:
    - - - activation_13
        - 0
        - 0
        - {}
    name: res3b_branch2a
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: bn3b_branch2a
      scale: true
      trainable: false
    inbound_nodes:
    - - - res3b_branch2a
        - 0
        - 0
        - {}
    name: bn3b_branch2a
  - class_name: Activation
    config: {activation: relu, name: activation_14, trainable: false}
    inbound_nodes:
    - - - bn3b_branch2a
        - 0
        - 0
        - {}
    name: activation_14
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 128
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [3, 3]
      name: res3b_branch2b
      padding: same
      strides: *id002
      trainable: false
      use_bias: true
    inbound_nodes:
    - - - activation_14
        - 0
        - 0
        - {}
    name: res3b_branch2b
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: bn3b_branch2b
      scale: true
      trainable: false
    inbound_nodes:
    - - - res3b_branch2b
        - 0
        - 0
        - {}
    name: bn3b_branch2b
  - class_name: Activation
    config: {activation: relu, name: activation_15, trainable: false}
    inbound_nodes:
    - - - bn3b_branch2b
        - 0
        - 0
        - {}
    name: activation_15
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 512
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: *id007
      name: res3b_branch2c
      padding: valid
      strides: *id002
      trainable: false
      use_bias: true
    inbound_nodes:
    - - - activation_15
        - 0
        - 0
        - {}
    name: res3b_branch2c
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: bn3b_branch2c
      scale: true
      trainable: false
    inbound_nodes:
    - - - res3b_branch2c
        - 0
        - 0
        - {}
    name: bn3b_branch2c
  - class_name: Add
    config: {name: add_5, trainable: false}
    inbound_nodes:
    - - - bn3b_branch2c
        - 0
        - 0
        - &id014 {}
      - - activation_13
        - 0
        - 0
        - *id014
    name: add_5
  - class_name: Activation
    config: {activation: relu, name: activation_16, trainable: false}
    inbound_nodes:
    - - - add_5
        - 0
        - 0
        - {}
    name: activation_16
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 128
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: *id006
      name: res3c_branch2a
      padding: valid
      strides: *id002
      trainable: false
      use_bias: true
    inbound_nodes:
    - - - activation_16
        - 0
        - 0
        - {}
    name: res3c_branch2a
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: bn3c_branch2a
      scale: true
      trainable: false
    inbound_nodes:
    - - - res3c_branch2a
        - 0
        - 0
        - {}
    name: bn3c_branch2a
  - class_name: Activation
    config: {activation: relu, name: activation_17, trainable: false}
    inbound_nodes:
    - - - bn3c_branch2a
        - 0
        - 0
        - {}
    name: activation_17
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 128
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [3, 3]
      name: res3c_branch2b
      padding: same
      strides: *id002
      trainable: false
      use_bias: true
    inbound_nodes:
    - - - activation_17
        - 0
        - 0
        - {}
    name: res3c_branch2b
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: bn3c_branch2b
      scale: true
      trainable: false
    inbound_nodes:
    - - - res3c_branch2b
        - 0
        - 0
        - {}
    name: bn3c_branch2b
  - class_name: Activation
    config: {activation: relu, name: activation_18, trainable: false}
    inbound_nodes:
    - - - bn3c_branch2b
        - 0
        - 0
        - {}
    name: activation_18
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 512
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: *id007
      name: res3c_branch2c
      padding: valid
      strides: *id002
      trainable: false
      use_bias: true
    inbound_nodes:
    - - - activation_18
        - 0
        - 0
        - {}
    name: res3c_branch2c
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: bn3c_branch2c
      scale: true
      trainable: false
    inbound_nodes:
    - - - res3c_branch2c
        - 0
        - 0
        - {}
    name: bn3c_branch2c
  - class_name: Add
    config: {name: add_6, trainable: false}
    inbound_nodes:
    - - - bn3c_branch2c
        - 0
        - 0
        - &id015 {}
      - - activation_16
        - 0
        - 0
        - *id015
    name: add_6
  - class_name: Activation
    config: {activation: relu, name: activation_19, trainable: false}
    inbound_nodes:
    - - - add_6
        - 0
        - 0
        - {}
    name: activation_19
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 128
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: *id006
      name: res3d_branch2a
      padding: valid
      strides: *id002
      trainable: false
      use_bias: true
    inbound_nodes:
    - - - activation_19
        - 0
        - 0
        - {}
    name: res3d_branch2a
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: bn3d_branch2a
      scale: true
      trainable: false
    inbound_nodes:
    - - - res3d_branch2a
        - 0
        - 0
        - {}
    name: bn3d_branch2a
  - class_name: Activation
    config: {activation: relu, name: activation_20, trainable: false}
    inbound_nodes:
    - - - bn3d_branch2a
        - 0
        - 0
        - {}
    name: activation_20
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 128
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [3, 3]
      name: res3d_branch2b
      padding: same
      strides: *id002
      trainable: false
      use_bias: true
    inbound_nodes:
    - - - activation_20
        - 0
        - 0
        - {}
    name: res3d_branch2b
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: bn3d_branch2b
      scale: true
      trainable: false
    inbound_nodes:
    - - - res3d_branch2b
        - 0
        - 0
        - {}
    name: bn3d_branch2b
  - class_name: Activation
    config: {activation: relu, name: activation_21, trainable: false}
    inbound_nodes:
    - - - bn3d_branch2b
        - 0
        - 0
        - {}
    name: activation_21
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 512
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: *id007
      name: res3d_branch2c
      padding: valid
      strides: *id002
      trainable: false
      use_bias: true
    inbound_nodes:
    - - - activation_21
        - 0
        - 0
        - {}
    name: res3d_branch2c
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: bn3d_branch2c
      scale: true
      trainable: false
    inbound_nodes:
    - - - res3d_branch2c
        - 0
        - 0
        - {}
    name: bn3d_branch2c
  - class_name: Add
    config: {name: add_7, trainable: false}
    inbound_nodes:
    - - - bn3d_branch2c
        - 0
        - 0
        - &id016 {}
      - - activation_19
        - 0
        - 0
        - *id016
    name: add_7
  - class_name: Activation
    config: {activation: relu, name: activation_22, trainable: false}
    inbound_nodes:
    - - - add_7
        - 0
        - 0
        - {}
    name: activation_22
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 256
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: *id009
      name: res4a_branch2a
      padding: valid
      strides: *id012
      trainable: false
      use_bias: true
    inbound_nodes:
    - - - activation_22
        - 0
        - 0
        - {}
    name: res4a_branch2a
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: bn4a_branch2a
      scale: true
      trainable: false
    inbound_nodes:
    - - - res4a_branch2a
        - 0
        - 0
        - {}
    name: bn4a_branch2a
  - class_name: Activation
    config: {activation: relu, name: activation_23, trainable: false}
    inbound_nodes:
    - - - bn4a_branch2a
        - 0
        - 0
        - {}
    name: activation_23
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 256
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [3, 3]
      name: res4a_branch2b
      padding: same
      strides: *id002
      trainable: false
      use_bias: true
    inbound_nodes:
    - - - activation_23
        - 0
        - 0
        - {}
    name: res4a_branch2b
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: bn4a_branch2b
      scale: true
      trainable: false
    inbound_nodes:
    - - - res4a_branch2b
        - 0
        - 0
        - {}
    name: bn4a_branch2b
  - class_name: Activation
    config: {activation: relu, name: activation_24, trainable: false}
    inbound_nodes:
    - - - bn4a_branch2b
        - 0
        - 0
        - {}
    name: activation_24
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 1024
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: *id010
      name: res4a_branch2c
      padding: valid
      strides: *id002
      trainable: false
      use_bias: true
    inbound_nodes:
    - - - activation_24
        - 0
        - 0
        - {}
    name: res4a_branch2c
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 1024
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: *id011
      name: res4a_branch1
      padding: valid
      strides: *id012
      trainable: false
      use_bias: true
    inbound_nodes:
    - - - activation_22
        - 0
        - 0
        - {}
    name: res4a_branch1
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: bn4a_branch2c
      scale: true
      trainable: false
    inbound_nodes:
    - - - res4a_branch2c
        - 0
        - 0
        - {}
    name: bn4a_branch2c
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: bn4a_branch1
      scale: true
      trainable: false
    inbound_nodes:
    - - - res4a_branch1
        - 0
        - 0
        - {}
    name: bn4a_branch1
  - class_name: Add
    config: {name: add_8, trainable: false}
    inbound_nodes:
    - - - bn4a_branch2c
        - 0
        - 0
        - &id017 {}
      - - bn4a_branch1
        - 0
        - 0
        - *id017
    name: add_8
  - class_name: Activation
    config: {activation: relu, name: activation_25, trainable: false}
    inbound_nodes:
    - - - add_8
        - 0
        - 0
        - {}
    name: activation_25
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 256
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: *id006
      name: res4b_branch2a
      padding: valid
      strides: *id002
      trainable: false
      use_bias: true
    inbound_nodes:
    - - - activation_25
        - 0
        - 0
        - {}
    name: res4b_branch2a
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: bn4b_branch2a
      scale: true
      trainable: false
    inbound_nodes:
    - - - res4b_branch2a
        - 0
        - 0
        - {}
